var 通用顶层数据格式 = {
    /* 数据的存放字段 */
    "data":{}, 
    //返回消息
    "msg":"",
    //消息处理是否成功
    "ok":true,
    //列表数据总数量
    "count":100
}

//新闻和观点都是内容，区别是type不同
var 内容 = {
    //标题
    "title" :"",
    //作者
    "anthor" :"",
    //微信成功发布时间
    "ptime" :"",
    //状态。 -1:所有(查询使用)，0:待审核，20:可发布，40:已发布
    "state" :-1,
    //子标题
    "stitle" :"",
    //类型。-1:所有(查询使用)，0:观点,20:新闻
    "type" :-1,
    //正文
    "content" :"",
    //微信发布计划开始时间
    "pubbegin" :"2019/9/9 00:00:00",
    //微信发布计划结束时间(内容列表中的预计推送时间以end为准)
    "pubend" :"2019/9/9 00:00:00",
}

var 课程 = {
    //课程名称
    "name":"",
    //课程总时长(小时)，2位精确小数
    "along":0.00,
    //有效期
    "terml":0,
    //有效期数量计数单位,-1:所有(查询使用)，0:小时,1:天,2:周,3:月,4:年,20:永久
    "termu":0,
    //是否面授
    "byface":true,
    //是否直播
    "bylive":true,
    //报名开始时间
    "rbegin":"2019/9/9 00:00:00",
    //报名结束时间
    "rend":"2019/9/9 00:00:00",
    //教师姓名
    "tname":"",
    //课程介绍
    "subint":"",
    //课程大纲
    "subline":"",
    //师资展示
    "tecint":"",
    //听课指导
    "lisint":"",
    //班级
    "class":[
        {
            //班级名称
            "name":"",
            //班级可容纳人数
            "count":0
        }
    ],
    //直播排期
    "live":{
        "timer":{
            //课程有效时间
            "begin":"2019/9/9 00:00:00",
            //课程有效时间
            "end":"2019/9/9 00:00:00"
        },
        "rate":[
            {
                //课程上课时间
                "begin":"2019/9/9 19:00:00",
                //课程上课时间
                "end":"2019/9/9 20:00:00",
                //周一
                "w1":true,
                //周二
                "w2":true,
                //周三
                "w3":true,
                //周四
                "w4":true,
                //周五
                "w5":true,
                //周六
                "w6":true,
                //周日
                "w7":true,
            }
        ]
    },
    //面授排期
    "face":{
        "timer":{
            //课程有效时间
            "begin":"2019/9/9 00:00:00",
            //课程有效时间
            "end":"2019/9/9 00:00:00"
        },
        "rate":[
            {
                //课程上课时间
                "begin":"2019/9/9 19:00:00",
                //课程上课时间
                "end":"2019/9/9 20:00:00",
                //周一
                "w1":true,
                //周二
                "w2":true,
                //周三
                "w3":true,
                //周四
                "w4":true,
                //周五
                "w5":true,
                //周六
                "w6":true,
                //周日
                "w7":true,
            }
        ]
    }
}